In [2]:
import pandas as pd

import dependencies

In [3]:
path_input = dependencies.rootFolder / 'data' / 'raw'
path_output = dependencies.rootFolder / 'data' / 'processed'

In [5]:
df_camiones = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='A:D'
)

In [6]:
df_camiones

   VEHÍCULO   WILAYA modelo   ESTADO
0      CC53    Aaiun   VOLVO     NaN
1      CC54    Aaiun   VOLVO     NaN
2      CC55    Aaiun   VOLVO     NaN
3      CC56    Aaiun   VOLVO     NaN
4      CC57    Aaiun   VOLVO     NaN
..      ...      ...     ...     ...
79    CR219    Smara     MAN     NaN
80    CR223    Smara     MAN     NaN
81    CR224    Smara     MAN     NaN
82    CR225  Bojador     MAN     NaN
83    CR226    Dajla     MAN     NaN

[84 rows x 4 columns]

In [31]:
df_camiones.to_csv(path_output / "Camiones.csv")

In [104]:
df_wilayas = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='B'    
)

In [105]:
df_wilayas

     WILAYA
0     Aaiun
1     Aaiun
2     Aaiun
3     Aaiun
4     Aaiun
..      ...
79    Smara
80    Smara
81    Smara
82  Bojador
83    Dajla

[84 rows x 1 columns]

In [106]:
df_wilayas["WILAYA"] = df_wilayas["WILAYA"].str.capitalize()

In [107]:
df_wilayas = df_wilayas["WILAYA"].drop_duplicates()

In [108]:
df_wilayas = df_wilayas.replace(["Inst"],["Instituciones"])

In [242]:
df_wilayas = pd.DataFrame(df_wilayas.unique())

AttributeError: 'DataFrame' object has no attribute 'unique'

In [114]:
df_wilayas

                0
0           Aaiun
1  Taller central
2          Auserd
3         Bojador
4           Smara
5   Instituciones
6           Dajla
7      Transporte

In [87]:
df_wilayas.to_csv(path_output / "Wilayas.csv")

In [64]:
df_tagnum = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='M:N',
    skiprows=19
)

In [65]:
df_tagnum

   Unnamed: 12  Unnamed: 13
0         CC53     559915.0
1         CC54     559916.0
2         CC55     559917.0
3         CC56     559918.0
4         CC57     559919.0
..         ...          ...
60         NaN          NaN
61         NaN          NaN
62         NaN          NaN
63         NaN          NaN
64         NaN          NaN

[65 rows x 2 columns]

In [91]:
df_tagnum.columns

Index(['Unnamed: 12', 'Unnamed: 13'], dtype='object')

In [117]:
df_camiones2 = pd.merge(df_camiones, df_tagnum, left_on="VEHÍCULO", right_on="Unnamed: 12")

In [118]:
df_camiones2

   VEHÍCULO  WILAYA    modelo   ESTADO Unnamed: 12  Unnamed: 13
0      CC53   Aaiun      VOLVO     NaN        CC53     559915.0
1      CC54   Aaiun      VOLVO     NaN        CC54     559916.0
2      CC55   Aaiun      VOLVO     NaN        CC55     559917.0
3      CC56   Aaiun      VOLVO     NaN        CC56     559918.0
4      CC57   Aaiun      VOLVO     NaN        CC57     559919.0
..      ...     ...        ...     ...         ...          ...
60     CC11  Auserd  Sinotruck     NaN        CC11     771482.0
61     CC12   Dajla  Sinotruck     NaN        CC12     771483.0
62    CR217   Aaiun        MAN     NaN       CR217     771484.0
63    CR218   Aaiun        MAN     NaN       CR218     771485.0
64    CR219   Smara        MAN     NaN       CR219     771486.0

[65 rows x 6 columns]

In [143]:
df_mecanicos = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='BaseDatosCorrectiva 2022',
    usecols='F:I',
    skiprows=9
)

c:\Users\DiegoFernandezPradal\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [144]:
df_mecanicos.columns = ["mec1", "mec2", "mec3", "mec4"]

In [145]:
df_mecanicos

       mec1        mec2 mec3 mec4
0       dah         NaN  NaN  NaN
1     jatri  hasan chej  NaN  NaN
2     jatri  hasan chej  NaN  NaN
3     jatri  hasan chej  NaN  NaN
4     jatri  hasan chej  NaN  NaN
...     ...         ...  ...  ...
2977    NaN         NaN  NaN  NaN
2978    NaN         NaN  NaN  NaN
2979    NaN         NaN  NaN  NaN
2980    NaN         NaN  NaN  NaN
2981    NaN         NaN  NaN  NaN

[2982 rows x 4 columns]

In [146]:
df_mecanicos2 = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='preventive BBDD',
    usecols='F:I',
    skiprows=5
)

c:\Users\DiegoFernandezPradal\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [147]:
df_mecanicos2.columns = ["mec1", "mec2", "mec3", "mec4"]

In [148]:
df_mecanicos2

       mec1 mec2 mec3 mec4
0    todos   NaN  NaN  NaN
1    todos   NaN  NaN  NaN
2    todos   NaN  NaN  NaN
3    todos   NaN  NaN  NaN
4    todos   NaN  NaN  NaN
..      ...  ...  ...  ...
679     NaN  NaN  NaN  NaN
680     NaN  NaN  NaN  NaN
681     NaN  NaN  NaN  NaN
682     NaN  NaN  NaN  NaN
683     NaN  NaN  NaN  NaN

[684 rows x 4 columns]

In [281]:
df_mecanicos = pd.concat([df_mecanicos, df_mecanicos2])

In [150]:
df_mecanicos = pd.concat([df_mecanicos["mec1"], df_mecanicos["mec2"], df_mecanicos["mec3"], df_mecanicos["mec4"]]).dropna()

In [151]:
df_mecanicos = df_mecanicos.str.lower()

In [243]:
df_mecanicos = pd.DataFrame(df_mecanicos.unique())

AttributeError: 'DataFrame' object has no attribute 'unique'

In [168]:
df_mecanicos.columns=["mecanicos"]

In [244]:
df_mecanicos

            mecanicos
0                 dah
1               jatri
2        ahmed andala
3        brahim salem
4        moh abdalahi
5           moh fadel
6                 ali
7              laulad
8           sidi alal
9               txapu
10            brahim
11        jefe taller
12      bal-lal hammu
13             sidati
14      mohamed lamin
15      jatri mohamed
16  ahmed salek andal
17    mec transporte
18   salek logistica
19     mohamed fadel
20              lamni
21              todos
22            mohamed
23              saleh
24               dah
25      baba lebisir
26   mohamed abdalahi
27         hasan chej
28          conductor
29             todos
30             chofer
31               ali
32         sidi alal
33           sid alal
34         dah abidin
35              salek
36             juanjo
37      moha abdalahi
38          salek ali
39   chaibata gailani
40               adah
41       jefe taller
42       mohmed lamin
43            bachir
44      moh abdalahi
45        salek ali

In [169]:
df_mecanicos3 = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='I:K',
    skiprows=1
)

In [170]:
df_mecanicos3.dropna(subset=["Taller"])

                Nombre          Taller           Oficio
0                 dah         Boujdour         Mecánico
1                saleh        Boujdour  Asist. Mecánico
2        mohamed lamin           Aused  Asist. Mecánico
3         brahim salem           Aused         Mecánico
4        Bal-lal Hammu           Dajla         Mecánico
5   Ahmed Mohamed Lmin           Dajla  Asist. Mecánico
6    Ahmed salek Andal           Aaiun         Mecánico
7            Salek Ali           Aaiun  Asist. Mecánico
8            moh fadel  taller general              NaN
9                 Adah  taller general              NaN
10                 Ali  taller general              NaN
11    Mohamed Abdalahi  taller general              NaN
12              Laulad  taller general              NaN
13           Sidi Alal  taller general              NaN
14    Chaibata Gailani  taller general              NaN
15       Jatri Mohamed           Smara         Mecánico
16          hasan chej           Smara  Asist. Mecánico
17               todos  taller general              NaN
18     mec transporte      transporte          Mecánico
19           conductor          centro              NaN
20      mohamed fadel   taller general     jefe taller
21               txapu           attsf          tecnico
22              juanjo           attsf              NaN
23             bachir   taller general     jefe almacen
27       baba lebisir    intervencion               NaN

In [175]:
df_mecanicos3 = pd.merge(df_mecanicos, df_mecanicos3, how="left", left_on="mecanicos", right_on="Nombre")

In [176]:
df_mecanicos3

,mecanicos,mecanicos_x,mecanicos_y,Nombre,Taller,Oficio
0,dah,NaN,NaN,NaN,NaN,NaN
1,jatri,NaN,NaN,NaN,NaN,NaN
2,ahmed andala,NaN,NaN,NaN,NaN,NaN
3,brahim salem,brahim salem,brahim salem,brahim salem,Aused,Mecánico
4,moh abdalahi,NaN,NaN,NaN,NaN,NaN
5,moh fadel,moh fadel,moh fadel,moh fadel,taller general,NaN
6,ali,NaN,NaN,NaN,NaN,NaN
7,laulad,NaN,NaN,NaN,NaN,NaN
8,sidi alal,NaN,NaN,NaN,NaN,NaN
9,txapu,txapu,txapu,txapu,attsf,tecnico
10,brahim,NaN,NaN,NaN,NaN,NaN
11,jefe taller,NaN,NaN,NaN,NaN,NaN
12,bal-lal hammu,NaN,NaN,NaN,NaN,NaN
13,sidati,NaN,NaN,NaN,NaN,NaN
14,mohamed lamin,mohamed lamin,mohamed lamin,mohamed lamin,Aused,Asist. Mecánico
15,jatri mohamed,NaN,NaN,NaN,NaN,NaN
16,ahmed salek andal,NaN,NaN,NaN,NaN,NaN
17,mec transporte,mec transporte,mec transporte,mec transporte,transporte,Mecánico
18,salek logistica,salek logistica,salek logistica,salek logistica,NaN,NaN
19,mohamed fadel,mohamed fadel,mohamed fadel,mohamed fadel,taller general,jefe taller
20,lamni,lamni,lamni,lamni,NaN,NaN
21,todos,todos,todos,todos,taller general,NaN
22,mohamed,mohamed,mohamed,mohamed,NaN,NaN
23,saleh,saleh,saleh,saleh,Boujdour,Asist. Mecánico
24,dah,dah,dah,dah,Boujdour,Mecánico
25,baba lebisir,baba lebisir,baba lebisir,baba lebisir,intervencion,NaN
26,mohamed abdalahi,NaN,NaN,NaN,NaN,NaN
27,hasan chej,hasan chej,hasan chej,hasan chej,Smara,Asist. Mecánico
28,conductor,conductor,conductor,conductor,centro,NaN
29,conductor,conductor,conductor,conductor,NaN,NaN
30,todos,NaN,NaN,NaN,NaN,NaN
31,chofer,NaN,NaN,NaN,NaN,NaN
32,ali,NaN,NaN,NaN,NaN,NaN
33,sidi alal,NaN,NaN,NaN,NaN,NaN
34,sid alal,NaN,NaN,NaN,NaN,NaN
35,dah abidin,NaN,NaN,NaN,NaN,NaN
36,salek,NaN,NaN,NaN,NaN,NaN
37,juanjo,juanjo,juanjo,juanjo,attsf,NaN
38,moha abdalahi,NaN,NaN,NaN,NaN,NaN
39,salek ali,NaN,NaN,NaN,NaN,NaN
40,chaibata gailani,NaN,NaN,NaN,NaN,NaN
41,adah,NaN,NaN,NaN,NaN,NaN
42,jefe taller,NaN,NaN,NaN,NaN,NaN
43,mohmed lamin,NaN,NaN,NaN,NaN,NaN
44,bachir,bachir,bachir,bachir,taller general,jefe almacen
45,moh abdalahi,NaN,NaN,NaN,NaN,NaN
46,salek ali,NaN,NaN,NaN,NaN,NaN

In [191]:
df_averia = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='preventive BBDD',
    usecols='Q:AE',
    skiprows=5,
    nrows=0
)

In [192]:
df_averia

Empty DataFrame
Columns: [Aceite, Anticongelante, Embrague, H Direccion, Baterias,  L Freno, A. caja, A/destil, Ruedas, Lamparas, D/tacgfo, S. lava, J. carroceria, Calcho, Grasa]
Index: []

In [193]:
df_averia.transpose()

Empty DataFrame
Columns: []
Index: [Aceite, Anticongelante, Embrague, H Direccion, Baterias,  L Freno, A. caja, A/destil, Ruedas, Lamparas, D/tacgfo, S. lava, J. carroceria, Calcho, Grasa]

In [198]:
df_averia2 = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='BaseDatosCorrectiva 2022',
    usecols='S:AE',
    skiprows=9,
    nrows=0
)

In [199]:
df_averia2

Empty DataFrame
Columns: [Chasis, Carrocería, Ruedas, Mecanica, Elec, vehiculos, Obra civil, Agua y combustible, Herramientas, Informatica, Exteriores, Aire, Maquinaria, elecricidad]
Index: []

In [200]:
df_averia2.transpose()

Empty DataFrame
Columns: []
Index: [Chasis, Carrocería, Ruedas, Mecanica, Elec, vehiculos, Obra civil, Agua y combustible, Herramientas, Informatica, Exteriores, Aire, Maquinaria, elecricidad]

In [202]:
df_averias = pd.concat([df_averia, df_averia2])

In [204]:
df_averias

Empty DataFrame
Columns: [Aceite, Anticongelante, Embrague, H Direccion, Baterias,  L Freno, A. caja, A/destil, Ruedas, Lamparas, D/tacgfo, S. lava, J. carroceria, Calcho, Grasa, Chasis, Carrocería, Mecanica, Elec, vehiculos, Obra civil, Agua y combustible, Herramientas, Informatica, Exteriores, Aire, Maquinaria, elecricidad]
Index: []

[0 rows x 27 columns]

In [205]:
df_averias.transpose()

Empty DataFrame
Columns: []
Index: [Aceite, Anticongelante, Embrague, H Direccion, Baterias,  L Freno, A. caja, A/destil, Ruedas, Lamparas, D/tacgfo, S. lava, J. carroceria, Calcho, Grasa, Chasis, Carrocería, Mecanica, Elec, vehiculos, Obra civil, Agua y combustible, Herramientas, Informatica, Exteriores, Aire, Maquinaria, elecricidad]

In [210]:
df_taller = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='G:H',
    skiprows=48
)

In [212]:
df_taller.columns=["tipo taller", "taller"]

In [216]:
df_taller = df_taller.dropna()

In [296]:
df_taller

  tipo taller          taller
0          TR           Aaiun
1          TR           Smara
2          TR          Auserd
3          TR           Dajla
4          TR         Bojador
5         ATC   Instituciones
6         ATC  taller central

In [336]:
df_tipomant = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='M',
    skiprows=1,
    nrows= 18
)

In [337]:
df_tipomant = df_tipomant.dropna()

In [338]:
df_tipomant

     Tipos mantto
0           Anual
1       Semestral
2         Mensual
3         Semanal
4  Cuatrimestral

In [339]:
df_tipomant2 = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='preventive BBDD',
    usecols='D',
    skiprows=5
)

c:\Users\DiegoFernandezPradal\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [340]:
df_tipomant2 = df_tipomant2.dropna()

In [341]:
df_tipomant2

    Clase de Mantenimiento
0               semestral
1               semestral
2               semestral
3           Cuatrimestral
4           Cuatrimestral
..                     ...
489                Mensual
490                Mensual
491                Mensual
492                Mensual
493                Mensual

[494 rows x 1 columns]

In [342]:
df_tipomant2["Clase de Mantenimiento"] = df_tipomant2["Clase de Mantenimiento"].str.capitalize()

In [343]:
df_tipomant2

    Clase de Mantenimiento
0               Semestral
1               Semestral
2               Semestral
3           Cuatrimestral
4           Cuatrimestral
..                     ...
489                Mensual
490                Mensual
491                Mensual
492                Mensual
493                Mensual

[494 rows x 1 columns]

In [344]:
df_tipomant2 = df_tipomant2["Clase de Mantenimiento"].drop_duplicates()

In [345]:
df_tipomant2

0          Semestral
3      Cuatrimestral
7             Mensual
54          Semestral
102             Anual
Name: Clase de Mantenimiento, dtype: object

In [346]:
df_tipomant = pd.merge(df_tipomant, df_tipomant2, how="left", left_on="Tipos mantto", right_on="Clase de Mantenimiento")

In [347]:
df_tipomant

     Tipos mantto Clase de Mantenimiento
0           Anual                  Anual
1       Semestral              Semestral
2         Mensual                Mensual
3         Semanal                    NaN
4  Cuatrimestral          Cuatrimestral

In [348]:
df_tipomant = pd.concat([df_tipomant["Tipos mantto"], df_tipomant["Clase de Mantenimiento"]])

In [349]:
df_tipomant

0             Anual
1         Semestral
2           Mensual
3           Semanal
4    Cuatrimestral
0             Anual
1         Semestral
2           Mensual
3               NaN
4    Cuatrimestral
dtype: object

In [353]:
df_tipomant = df_tipomant.dropna

AttributeError: 'function' object has no attribute 'dropna'

In [355]:
df_tipomant

<bound method Series.dropna of 0             Anual
1         Semestral
2           Mensual
3           Semanal
4    Cuatrimestral
0             Anual
1         Semestral
2           Mensual
3               NaN
4    Cuatrimestral
dtype: object>

In [356]:
df_tipomant = df_tipomant[]

AttributeError: 'function' object has no attribute 'unique'